#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_eip.nat: Refreshing state... [id=eipalloc-029fe88dacc31050b]
aws_iam_role.nodes: Refreshing state... [id=eks-node-group-nodes]
aws_iam_policy.test-policy: Refreshing state... [id=arn:aws:iam::467121734390:policy/test-policy]
aws_iam_policy.eks_cluster_autoscaler: Refreshing state... [id=arn:aws:iam::467121734390:policy/eks-cluster-autoscaler]
aws_vpc.main: Refreshing state... [id=vpc-099f7b05fda8d673d]
aws_iam_role.demo: Refreshing state... [id=eks-cluster-primo]
aws_iam_role_policy_attachment.nodes-AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-nodes-20230429180759052700000003]
aws_iam_role_policy_attachment.nodes-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-nodes-20230429180759092600000004]
aws_iam_role_policy_attachment.nodes-AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-nodes-20230429180759048000000001]
aws_iam_role_policy_attachment.demo-AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-primo-20230429180759048400000002]
aws_route_table.public: Refreshing state... [id=rtb-0498dc19c13fd019f]
aws_subnet.private-us-east-1b: Refreshing state... [id=subnet-0cd9a55bc655e8cda]
aws_route_table.private: Refreshing state... [id=rtb-0d6b9669989a3d2a5]
aws_subnet.private-us-east-1a: Refreshing state... [id=subnet-064f96a2c039a5011]
aws_subnet.public-us-east-1a: Refreshing state... [id=subnet-08d282ba264628b4d]
aws_internet_gateway.igw: Refreshing state... [id=igw-06030563df0908983]
aws_subnet.public-us-east-1b: Refreshing state... [id=subnet-080d4c315642912fc]
aws_route_table_association.public-us-east-1a: Refreshing state... [id=rtbassoc-0992de150cc722aa3]
aws_route_table_association.private-us-east-1a: Refreshing state... [id=rtbassoc-0e7aff69ea2b4923d]
aws_nat_gateway.nat: Refreshing state... [id=nat-0a76cceca4c0a0170]
aws_route.public_route: Refreshing state... [id=r-rtb-0498dc19c13fd019f1080289494]
aws_route_table_association.public-us-east-1b: Refreshing state... [id=rtbassoc-0e9b8c831d9ecf037]
aws_route_table_association.private-us-east-1b: Refreshing state... [id=rtbassoc-0af2f9fac9c15165d]
aws_eks_cluster.demo: Refreshing state... [id=primotioficial]
aws_route.private_route: Refreshing state... [id=r-rtb-0d6b9669989a3d2a51080289494]
data.tls_certificate.eks: Reading...
aws_eks_node_group.private-nodes: Refreshing state... [id=primotioficial:private-nodes]
data.tls_certificate.eks: Read complete after 0s [id=8cb781b6037f4703f17f42d8de4a2c2aa78474ab]
aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::467121734390:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/1889933B414973F508FD9FA4DF712489]
data.aws_iam_policy_document.eks_cluster_autoscaler_assume_role_policy: Reading...
data.aws_iam_policy_document.test_oidc_assume_role_policy: Reading...
data.aws_iam_policy_document.eks_cluster_autoscaler_assume_role_policy: Read complete after 0s [id=1410824055]
data.aws_iam_policy_document.test_oidc_assume_role_policy: Read complete after 0s [id=1538986056]
aws_iam_role.eks_cluster_autoscaler: Refreshing state... [id=eks-cluster-autoscaler]
aws_iam_role.test_oidc: Refreshing state... [id=test-oidc]
aws_iam_role_policy_attachment.test_attach: Refreshing state... [id=test-oidc-20230429182456519700000001]
aws_iam_role_policy_attachment.eks_cluster_autoscaler_attach: Refreshing state... [id=eks-cluster-autoscaler-20230429181747040900000007]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.eks_images will be created
  + resource "aws_ecr_repository" "eks_images" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "eks-images"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @caiocqueiroz, Action: `pull_request`*